Revit 2027 API
FailureHandlingOptions.SetTransactionFinalizer Method
 Sets the callback to be executed after the transaction is completed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureHandlingOptions SetTransactionFinalizer(
	ITransactionFinalizer finalizer
)
Public Function SetTransactionFinalizer (
	finalizer As ITransactionFinalizer
) As FailureHandlingOptions
public:
FailureHandlingOptions^ SetTransactionFinalizer(
	ITransactionFinalizer^ finalizer
)
member SetTransactionFinalizer :
        finalizer : ITransactionFinalizer -> FailureHandlingOptions
Parameters
finalizer ITransactionFinalizer
 The callback to be executed after the transaction is completed.
Return Value
FailureHandlingOptions
 This FailureHandlingOptions object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace